core/ome-keybindings.org
#+TITLE: Oh My Emacs Keybindings
#+OPTIONS: toc:nil num:nil ^:nil

This is part of [[https://github.com/xiaohanyu/oh-my-emacs][oh-my-emacs]].

Key bindings for oh-my-emacs, mainly imported from [[https://github.com/eschulte/emacs24-starter-kit][emacs24-starter-kit]].

* You know, like Readline.

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-M-h") 'backward-kill-word)
#+END_SRC

* Align your code in a pretty way.

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-x \\") 'align-regexp)
#+END_SRC

* Completion that uses many different methods to find options.

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "M-/") 'hippie-expand)
#+END_SRC

* Font size

#+BEGIN_SRC emacs-lisp
(define-key global-map (kbd "C-+") 'text-scale-increase)
(define-key global-map (kbd "C--") 'text-scale-decrease)
#+END_SRC

* Use regex searches by default.

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-s") 'isearch-forward-regexp)
(global-set-key (kbd "C-r") 'isearch-backward-regexp)
(global-set-key (kbd "C-M-s") 'isearch-forward)
(global-set-key (kbd "C-M-r") 'isearch-backward)
#+END_SRC

* File finding
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-x M-f") 'ido-find-file-other-window)
(global-set-key (kbd "C-x C-p") 'find-file-at-point)
(global-set-key (kbd "C-c y") 'bury-buffer)
(global-set-key (kbd "C-c r") 'revert-buffer)
(global-set-key (kbd "M-`") 'file-cache-minibuffer-complete)
(global-set-key (kbd "C-x C-b") 'ibuffer)
#+END_SRC

* Window switching.
#+BEGIN_SRC emacs-lisp
(windmove-default-keybindings) ;; Shift+direction
(global-set-key (kbd "C-x O") (lambda () (interactive) (other-window -1))) ;; back one
(global-set-key (kbd "C-x C-o") (lambda () (interactive) (other-window 2))) ;; forward two
#+END_SRC

* Indentation help
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-x ^") 'join-line)
#+END_SRC

* If you want to be able to M-x without meta
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-x C-m") 'execute-extended-command)
#+END_SRC

* Help should search more than just commands
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-h a") 'apropos)
#+END_SRC

* Occur
Occur can show all lines in the current buffer containing a match for REGEXP.
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "C-c o") 'occur)
#+END_SRC

* RET

#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "RET") 'reindent-then-newline-and-indent)
#+END_SRC
